In [86]:
import pandas
import numpy
import calendar

In [2]:
df = pandas.read_csv('quakes.csv')
df_schema = pandas.read_csv('schema.csv')

In [3]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,FEB,24,23,30,25.0,38.9000,23.9000,10,5.3
1,1964,APR,11,16,0,0.0,39.7500,25.2500,10,5.7
2,1964,APR,21,8,14,40.0,38.5000,22.2500,10,4.5
3,1964,APR,24,3,49,58.0,38.0000,21.8000,10,5.0
4,1964,APR,29,4,21,0.0,39.2500,23.7500,10,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,APR,9,5,0,7.4,39.7856,21.9081,5,0.6
313396,2021,APR,9,5,0,21.9,39.7920,21.9328,5,1.5
313397,2021,APR,9,5,1,6.5,39.7160,22.1947,8,1.0
313398,2021,APR,9,5,2,5.6,39.7929,21.9154,6,1.0
313399,2021,APR,9,5,15,5.0,39.8007,21.8948,7,1.2

In [4]:
df_schema

      COLUMN                   ATTRIBUTE
0       YEAR       event Date: Year XXXX
1      MONTH      event Date: Month abbr
2        DAY             event Date: Day
3       HOUR  event Time (GMT): Hour 24h
4     MINUTE    event Time (GMT): Minute
5     SECOND    event Time (GMT): Second
6   LATITUDE          event Latitude (N)
7  LONGITUDE         event Longitude (E)
8      DEPTH            event Depth (km)
9  MAGNITUDE          event Magnitude Mr

In [39]:
df = df.append({'YEAR': 1983, 'MONTH': 'JAN', 'DAY': 17, 'DEPTH': 'NA', 'MAGNITUDE':10}, ignore_index=True)

In [40]:
df.dropna(axis='index', how='any', subset=['MAGNITUDE'])

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,FEB,24,23.0,30.0,25.0,38.9000,23.9000,10,5.3
1,1964,APR,11,16.0,0.0,0.0,39.7500,25.2500,10,5.7
2,1964,APR,21,8.0,14.0,40.0,38.5000,22.2500,10,4.5
3,1964,APR,24,3.0,49.0,58.0,38.0000,21.8000,10,5.0
4,1964,APR,29,4.0,21.0,0.0,39.2500,23.7500,10,5.8
...,...,...,...,...,...,...,...,...,...,...
313397,2021,APR,9,5.0,1.0,6.5,39.7160,22.1947,8,1.0
313398,2021,APR,9,5.0,2.0,5.6,39.7929,21.9154,6,1.0
313399,2021,APR,9,5.0,15.0,5.0,39.8007,21.8948,7,1.2
313400,1983,JAN,17,NaN,NaN,NaN,NaN,NaN,NaN,10.0
313401,1983,JAN,17,NaN,NaN,NaN,NaN,NaN,NA,10.0

In [41]:
filt = (df['HOUR'].isnull())

In [42]:
df[filt]

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
313400,1983,JAN,17,NaN,NaN,NaN,NaN,NaN,NaN,10.0
313401,1983,JAN,17,NaN,NaN,NaN,NaN,NaN,NA,10.0

In [49]:
df.iloc[313401] = df.iloc[313401].replace(10.0, 11.0)

In [50]:
df[filt]

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
313400,1983,JAN,17,NaN,NaN,NaN,NaN,NaN,NaN,10.0
313401,1983,JAN,17,NaN,NaN,NaN,NaN,NaN,NA,11.0

In [51]:
df.replace('NA', numpy.nan, inplace=True)

In [52]:
df[filt]

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
313400,1983,JAN,17,NaN,NaN,NaN,NaN,NaN,NaN,10.0
313401,1983,JAN,17,NaN,NaN,NaN,NaN,NaN,NaN,11.0

In [56]:
df.dropna(axis='index',how='any', subset=['DEPTH'], inplace=True)

In [57]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,FEB,24,23.0,30.0,25.0,38.9000,23.9000,10.0,5.3
1,1964,APR,11,16.0,0.0,0.0,39.7500,25.2500,10.0,5.7
2,1964,APR,21,8.0,14.0,40.0,38.5000,22.2500,10.0,4.5
3,1964,APR,24,3.0,49.0,58.0,38.0000,21.8000,10.0,5.0
4,1964,APR,29,4.0,21.0,0.0,39.2500,23.7500,10.0,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,APR,9,5.0,0.0,7.4,39.7856,21.9081,5.0,0.6
313396,2021,APR,9,5.0,0.0,21.9,39.7920,21.9328,5.0,1.5
313397,2021,APR,9,5.0,1.0,6.5,39.7160,22.1947,8.0,1.0
313398,2021,APR,9,5.0,2.0,5.6,39.7929,21.9154,6.0,1.0
313399,2021,APR,9,5.0,15.0,5.0,39.8007,21.8948,7.0,1.2

In [58]:
df.isna()

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
313395,False,False,False,False,False,False,False,False,False,False
313396,False,False,False,False,False,False,False,False,False,False
313397,False,False,False,False,False,False,False,False,False,False
313398,False,False,False,False,False,False,False,False,False,False
313399,False,False,False,False,False,False,False,False,False,False

In [59]:
df = df.append({'YEAR': 1983, 'MONTH': 'JAN', 'DAY': 17, 'DEPTH': 'NA', 'MAGNITUDE':10}, ignore_index=True)

In [60]:
df.isna()

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
313396,False,False,False,False,False,False,False,False,False,False
313397,False,False,False,False,False,False,False,False,False,False
313398,False,False,False,False,False,False,False,False,False,False
313399,False,False,False,False,False,False,False,False,False,False
313400,False,False,False,True,True,True,True,True,False,False

In [63]:
df.replace('NA', numpy.nan, inplace=True)

In [64]:
df.fillna('MISSING')

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,FEB,24,23,30,25,38.9,23.9,10,5.3
1,1964,APR,11,16,0,0,39.75,25.25,10,5.7
2,1964,APR,21,8,14,40,38.5,22.25,10,4.5
3,1964,APR,24,3,49,58,38,21.8,10,5.0
4,1964,APR,29,4,21,0,39.25,23.75,10,5.8
...,...,...,...,...,...,...,...,...,...,...
313396,2021,APR,9,5,0,21.9,39.792,21.9328,5,1.5
313397,2021,APR,9,5,1,6.5,39.716,22.1947,8,1.0
313398,2021,APR,9,5,2,5.6,39.7929,21.9154,6,1.0
313399,2021,APR,9,5,15,5,39.8007,21.8948,7,1.2
313400,1983,JAN,17,MISSING,MISSING,MISSING,MISSING,MISSING,MISSING,10.0

In [65]:
df.replace('MISSING', numpy.nan, inplace=True)

In [66]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,FEB,24,23.0,30.0,25.0,38.9000,23.9000,10.0,5.3
1,1964,APR,11,16.0,0.0,0.0,39.7500,25.2500,10.0,5.7
2,1964,APR,21,8.0,14.0,40.0,38.5000,22.2500,10.0,4.5
3,1964,APR,24,3.0,49.0,58.0,38.0000,21.8000,10.0,5.0
4,1964,APR,29,4.0,21.0,0.0,39.2500,23.7500,10.0,5.8
...,...,...,...,...,...,...,...,...,...,...
313396,2021,APR,9,5.0,0.0,21.9,39.7920,21.9328,5.0,1.5
313397,2021,APR,9,5.0,1.0,6.5,39.7160,22.1947,8.0,1.0
313398,2021,APR,9,5.0,2.0,5.6,39.7929,21.9154,6.0,1.0
313399,2021,APR,9,5.0,15.0,5.0,39.8007,21.8948,7.0,1.2
313400,1983,JAN,17,NaN,NaN,NaN,NaN,NaN,NaN,10.0

In [69]:
df.dropna(axis='index', how='any', subset=['DEPTH'], inplace=True)

In [70]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,FEB,24,23.0,30.0,25.0,38.9000,23.9000,10.0,5.3
1,1964,APR,11,16.0,0.0,0.0,39.7500,25.2500,10.0,5.7
2,1964,APR,21,8.0,14.0,40.0,38.5000,22.2500,10.0,4.5
3,1964,APR,24,3.0,49.0,58.0,38.0000,21.8000,10.0,5.0
4,1964,APR,29,4.0,21.0,0.0,39.2500,23.7500,10.0,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,APR,9,5.0,0.0,7.4,39.7856,21.9081,5.0,0.6
313396,2021,APR,9,5.0,0.0,21.9,39.7920,21.9328,5.0,1.5
313397,2021,APR,9,5.0,1.0,6.5,39.7160,22.1947,8.0,1.0
313398,2021,APR,9,5.0,2.0,5.6,39.7929,21.9154,6.0,1.0
313399,2021,APR,9,5.0,15.0,5.0,39.8007,21.8948,7.0,1.2

# casting datatypes

In [71]:
df.dtypes

YEAR           int64
MONTH         object
DAY            int64
HOUR         float64
MINUTE       float64
SECOND       float64
LATITUDE     float64
LONGITUDE    float64
DEPTH        float64
MAGNITUDE    float64
dtype: object

In [72]:
df['MAGNITUDE'].median()

2.3

## NaN is actually a float

In [73]:
type(numpy.nan)

float

In [74]:
df['MAGNITUDE'] = df['MAGNITUDE'].astype(str)

In [75]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,FEB,24,23.0,30.0,25.0,38.9000,23.9000,10.0,5.3
1,1964,APR,11,16.0,0.0,0.0,39.7500,25.2500,10.0,5.7
2,1964,APR,21,8.0,14.0,40.0,38.5000,22.2500,10.0,4.5
3,1964,APR,24,3.0,49.0,58.0,38.0000,21.8000,10.0,5.0
4,1964,APR,29,4.0,21.0,0.0,39.2500,23.7500,10.0,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,APR,9,5.0,0.0,7.4,39.7856,21.9081,5.0,0.6
313396,2021,APR,9,5.0,0.0,21.9,39.7920,21.9328,5.0,1.5
313397,2021,APR,9,5.0,1.0,6.5,39.7160,22.1947,8.0,1.0
313398,2021,APR,9,5.0,2.0,5.6,39.7929,21.9154,6.0,1.0
313399,2021,APR,9,5.0,15.0,5.0,39.8007,21.8948,7.0,1.2

In [77]:
df.dtypes

YEAR           int64
MONTH         object
DAY            int64
HOUR         float64
MINUTE       float64
SECOND       float64
LATITUDE     float64
LONGITUDE    float64
DEPTH        float64
MAGNITUDE     object
dtype: object

In [78]:
df['MAGNITUDE'] = df['MAGNITUDE'].astype(float)

In [79]:
df.dtypes

YEAR           int64
MONTH         object
DAY            int64
HOUR         float64
MINUTE       float64
SECOND       float64
LATITUDE     float64
LONGITUDE    float64
DEPTH        float64
MAGNITUDE    float64
dtype: object

In [82]:
df['MONTH'].replace({'JAN': 1, 'FEB': 2}, inplace=True)

In [83]:
df.head(100)

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,2,24,23.0,30.0,25.0,38.90,23.90,10.0,5.3
1,1964,APR,11,16.0,0.0,0.0,39.75,25.25,10.0,5.7
2,1964,APR,21,8.0,14.0,40.0,38.50,22.25,10.0,4.5
3,1964,APR,24,3.0,49.0,58.0,38.00,21.80,10.0,5.0
4,1964,APR,29,4.0,21.0,0.0,39.25,23.75,10.0,5.8
...,...,...,...,...,...,...,...,...,...,...
95,1965,DEC,8,11.0,22.0,5.0,37.30,28.50,10.0,4.5
96,1965,DEC,13,0.0,7.0,22.4,38.30,25.70,10.0,3.4
97,1965,DEC,13,11.0,19.0,50.7,38.00,24.00,10.0,2.7
98,1965,DEC,13,17.0,44.0,3.4,40.40,19.30,10.0,4.7
99,1965,DEC,16,12.0,32.0,47.0,35.00,23.00,10.0,4.3

In [84]:
df['MONTH'].replace({1: 'JAN', 2: 'FEB'}, inplace=True)

In [85]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,FEB,24,23.0,30.0,25.0,38.9000,23.9000,10.0,5.3
1,1964,APR,11,16.0,0.0,0.0,39.7500,25.2500,10.0,5.7
2,1964,APR,21,8.0,14.0,40.0,38.5000,22.2500,10.0,4.5
3,1964,APR,24,3.0,49.0,58.0,38.0000,21.8000,10.0,5.0
4,1964,APR,29,4.0,21.0,0.0,39.2500,23.7500,10.0,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,APR,9,5.0,0.0,7.4,39.7856,21.9081,5.0,0.6
313396,2021,APR,9,5.0,0.0,21.9,39.7920,21.9328,5.0,1.5
313397,2021,APR,9,5.0,1.0,6.5,39.7160,22.1947,8.0,1.0
313398,2021,APR,9,5.0,2.0,5.6,39.7929,21.9154,6.0,1.0
313399,2021,APR,9,5.0,15.0,5.0,39.8007,21.8948,7.0,1.2

In [89]:
tempdict = {x: y for (y,x) in enumerate(calendar.month_abbr)}

In [90]:
tempdict

{'': 0,
 'Jan': 1,
 'Feb': 2,
 'Mar': 3,
 'Apr': 4,
 'May': 5,
 'Jun': 6,
 'Jul': 7,
 'Aug': 8,
 'Sep': 9,
 'Oct': 10,
 'Nov': 11,
 'Dec': 12}

In [92]:
df['MONTH'] = df['MONTH'].str.title()

In [93]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,Feb,24,23.0,30.0,25.0,38.9000,23.9000,10.0,5.3
1,1964,Apr,11,16.0,0.0,0.0,39.7500,25.2500,10.0,5.7
2,1964,Apr,21,8.0,14.0,40.0,38.5000,22.2500,10.0,4.5
3,1964,Apr,24,3.0,49.0,58.0,38.0000,21.8000,10.0,5.0
4,1964,Apr,29,4.0,21.0,0.0,39.2500,23.7500,10.0,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,Apr,9,5.0,0.0,7.4,39.7856,21.9081,5.0,0.6
313396,2021,Apr,9,5.0,0.0,21.9,39.7920,21.9328,5.0,1.5
313397,2021,Apr,9,5.0,1.0,6.5,39.7160,22.1947,8.0,1.0
313398,2021,Apr,9,5.0,2.0,5.6,39.7929,21.9154,6.0,1.0
313399,2021,Apr,9,5.0,15.0,5.0,39.8007,21.8948,7.0,1.2

In [96]:
df.replace(tempdict, inplace=True)

In [99]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,2,24,23.0,30.0,25.0,38.9000,23.9000,10.0,5.3
1,1964,4,11,16.0,0.0,0.0,39.7500,25.2500,10.0,5.7
2,1964,4,21,8.0,14.0,40.0,38.5000,22.2500,10.0,4.5
3,1964,4,24,3.0,49.0,58.0,38.0000,21.8000,10.0,5.0
4,1964,4,29,4.0,21.0,0.0,39.2500,23.7500,10.0,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,4,9,5.0,0.0,7.4,39.7856,21.9081,5.0,0.6
313396,2021,4,9,5.0,0.0,21.9,39.7920,21.9328,5.0,1.5
313397,2021,4,9,5.0,1.0,6.5,39.7160,22.1947,8.0,1.0
313398,2021,4,9,5.0,2.0,5.6,39.7929,21.9154,6.0,1.0
313399,2021,4,9,5.0,15.0,5.0,39.8007,21.8948,7.0,1.2

In [100]:
df['MONTH'] = df['MONTH'].astype(str)

In [101]:
df.dtypes

YEAR           int64
MONTH         object
DAY            int64
HOUR         float64
MINUTE       float64
SECOND       float64
LATITUDE     float64
LONGITUDE    float64
DEPTH        float64
MAGNITUDE    float64
dtype: object

In [108]:
df['MONTH'] = df['MONTH'].astype(int)

In [109]:
df.dtypes

YEAR           int64
MONTH          int64
DAY            int64
HOUR         float64
MINUTE       float64
SECOND       float64
LATITUDE     float64
LONGITUDE    float64
DEPTH        float64
MAGNITUDE    float64
dtype: object

In [111]:
df['MONTH'].map('{0:02}'.format)

0         02
1         04
2         04
3         04
4         04
          ..
313395    04
313396    04
313397    04
313398    04
313399    04
Name: MONTH, Length: 313400, dtype: object